{
  "Version": "1.3.1",
  "BuildNumber": 18,
  "Notes": "### Release Notes (Last 1 day(s), CURRENT branch)\n\n---\n\n#### 🚀 Features\n\n- **Webview 2 Added**: A new webview component has been added to enhance the user interface. This component provides a more modern and interactive experience for users.\n\n#### 🐞 Bug Fixes\n\n- **hot-fixed**: A bug related to hot-reloading in the development environment has been fixed. Users can now see changes immediately without needing to refresh the page.\n\n#### 🛠️ Maintenance & Refactoring\n\n- **feat: add commit, release note signing scripts update ignore patterns**: Added new scripts for committing and signing release notes, which helps in maintaining consistency across different environments.\n- **3493b88 bump app version**: Updated the application version to reflect the latest changes. This ensures that all users are using the most recent features and bug fixes.\n\n#### 🛠️ Maintenance & Refactoring\n\n- **6e02b3b owner issues fixed**: Addressed an issue related to owner-specific issues in the project management system. Users can now easily manage their own tasks effectively.\n- **eef6c8d Theme now selected from system if not defined**: Changed the default theme to be selected from the system settings if no specific theme is defined. This improves user experience by providing a consistent look across different devices and environments.\n\n#### 🛠️ Maintenance & Refactoring\n\n- **eb84cea Theme applied to webdialog**: Applied the selected theme to the web dialog component. This ensures that all dialogs have a visually appealing design.\n- **272c1a3 theme applied to Image preview**: Applied the selected theme to the image preview component. This improves the visual appeal of images and enhances user experience.\n\n#### 🛠️ Maintenance & Refactoring\n\n- **2e40737 detail text & file form themes updated**: Updated the detail text and file form themes to reflect new design guidelines. This ensures that all forms have a consistent look and feel.\n- **7f4c475 Colors collected to single class**: Collected all colors into a single class for easy management and consistency across different parts of the application.\n\n---\n\nThese changes bring significant improvements and fixes, enhancing both the user interface and functionality of the project."
}
