{
  "Version": "1.3.4",
  "BuildNumber": 21,
  "Notes": "### Release Notes for Last 1 Day(s) on CURRENT Branch\n\n#### 🚀 Features\n- **Add Quick Paste Functionality to the Settings Form**: Users can now easily paste text directly into the settings form by hitting Enter, enhancing user experience.\n  \n#### 🐞 Bug Fixes\n- **Update Tray Application Context to Use Models**: Ensures that the tray application context uses models for better data management and consistency.\n  \n- **Fix Focus Handling to Reflect New Settings**: Adjusts focus handling based on new settings, ensuring smooth navigation in the application.\n\n- **Update URL Validation in MainForm.vm.cs**: Fixes an issue with URL validation, ensuring correct behavior when entering URLs into various input fields.\n\n- **Update AboutHtml.cs to Use New Utils Class**: Updates the AboutHtml class to utilize a new utility class for improved code organization and maintainability.\n\n- **Remove HelpHtml.cs File**: Removes an unnecessary HTML file from the project, simplifying the project structure.\n\n- **Update Settings Loader to Use New Poison Enum**: Updates the settings loader to use a new poison enumeration for better error handling and security practices.\n\n- **Remove Theme.cs**: Deletes the theme-related code, focusing on improving the overall design and user interface.\n\n- **Add UpdateInfo Model**: Adds a new model class for managing update information, enhancing the application's ability to track and display updates.\n\n- **Add UpdateInfoWrapper Class**: Creates a wrapper class for the update info model, providing additional functionality such as caching and version comparison.\n\n- **Add Pipe Server Functionality**: Introduces a pipe server functionality, enabling real-time communication between the application and external systems.\n\n- **Update Form Layout Settings Based on User Preferences**: Adjusts form layout settings based on user preferences, ensuring that the UI is responsive and visually appealing.\n\n- **Update Settings Form to Handle Always Topmost and Show in Taskbar Toggle Events**: Enhances the settings form by adding toggle events for always topmost and showing in taskbar, providing more customization options for users.\n\n- **Update WebDialog.cs to Handle Window Resizing and Dragging More Gracefully**: Improves the handling of window resizing and dragging in the WebDialog class, ensuring a smoother user experience.\n\n- **Update WebDialog.resx to Handle Window Resizing and Dragging More Gracefully**: Updates the resource file for the WebDialog, ensuring that it is compatible with different resolutions and screen sizes.\n\n- **Removed settings.json File**: Removes an unnecessary JSON file from the project, simplifying the project structure.\n\n- **Remove tempconfigs.json**: Deletes the temporary configuration file, focusing on improving the application's performance and security practices."
}
